In [1]:
import time
from datetime import datetime, timedelta
import pandas as pd
import numpy as np

In [2]:
db = pd.read_csv('base_de_datos.csv', dtype={'Sorteos': "string"}, parse_dates=['Dates'])

In [3]:
numbers = pd.DataFrame(columns=[number for number in range(51)]).astype("int64")
numbers = numbers.rename(columns={0: 'Sorteos'})
df_clean = {'Sorteos': "string"}
numbers = numbers.astype(df_clean)

,Nro1,Nro2,Nro3,Nro4,Nro5,Star_1,Star_2
count,1598.000000,1598.000000,1598.000000,1598.000000,1598.000000,1598.000000,1598.000000
mean,8.403004,16.843554,25.256571,34.003129,42.518773,3.934293,8.003755
std,6.616069,8.190090,8.667258,8.420723,6.751838,2.486797,2.547480
min,1.000000,2.000000,5.000000,9.000000,10.000000,1.000000,2.000000
25%,3.000000,10.000000,19.000000,28.000000,39.000000,2.000000,6.000000
50%,7.000000,16.000000,25.000000,35.000000,44.000000,3.000000,8.000000
75%,12.000000,23.000000,32.000000,40.000000,48.000000,6.000000,10.000000
max,38.000000,44.000000,47.000000,49.000000,50.000000,11.000000,12.000000

In [64]:
numbers

Empty DataFrame
Columns: [Sorteos, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]
Index: []

[0 rows x 51 columns]

In [69]:
list_of_numbers = [] # index of numbers
list_of_stars = [] # index of stars
for i in range(1, 51):
    list_of_numbers.append(i)
print(list_of_numbers)
for i in range(1, 13):
    list_of_stars.append(i)
print(list_of_stars)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

In [142]:
winners = db.iloc[:, 2:7]

In [111]:
rows = db[db['Nro1'] == 1]
print(rows)

                   Dates Sorteos  Nro1  Nro2  Nro3  Nro4  Nro5  Star_1  Star_2
8    2004-04-09 01:00:00       9     1     4    10    19    23       2       8
13   2004-05-14 01:00:00      14     1     3    21    32    39       2       6
28   2004-08-27 01:00:00      29     1    11    22    28    44       1       9
34   2004-10-08 01:00:00      35     1    10    12    16    48       2       6
36   2004-10-22 01:00:00      37     1     9    23    25    40       3       9
...                  ...     ...   ...   ...   ...   ...   ...     ...     ...
1511 2022-03-18 00:00:00    1512     1     9    14    17    43       6      12
1516 2022-04-05 01:00:00    1517     1    11    13    24    49       5       6
1517 2022-04-08 01:00:00    1518     1    15    16    38    45       4      11
1567 2022-09-30 01:00:00    1568     1     2    11    16    26       3      12
1590 2022-12-20 00:00:00    1591     1    11    17    20    27       4       5

[162 rows x 9 columns]

In [136]:
for number in winners:
    if number == i

TypeError: 'method' object is not iterable

In [144]:
winners = winners[0:1]

In [137]:
draws = draws.iloc[:, 0]

In [145]:
winners

   Nro1  Nro2  Nro3  Nro4  Nro5
0    16    29    32    36    41